{
    "Basics": {
      "greet":[
      {
        
        "Keywords": ["hello", "hi", "hey", "greetings", "good morning", "good afternoon"],
        "Answer": "Hello! How can I assist you today? Feel free to ask me about our courses, locations, or any other services we offer."
      }
    ],
    "basic_query":[
      {
         
          "Keywords":["What is Englishfirm","tell me about Englishfirm's services"," services do you offer","different from other coaching","benefits of Englishfirm"],
          "Answer":"Englishfirm is a leading coaching institute with a strong track record in PTE, IELTS, NAATI, and General English training. With years of experience, we offer personalized coaching plans tailored to each student's needs, led by expert trainers. Our flexible approach includes both online and in-person modes across multiple locations. We pride ourselves on our high success rate and commitment to student satisfaction. At Englishfirm, we don't just provide training—we equip you with the tools and confidence to succeed in your exams"
      }
    ]
    },
    "Courses": {
        "IELTS": [
            {
                
                "Keywords": ["What is IELTS?", "Tell me about IELTS", "Explain IELTS"],
                "Answer": "IELTS is the International English Language Testing System, designed to assess the language ability of candidates who need to study or work where English is the language of communication."
            },
            {
                
                "Keywords": ["IELTS courses modes", " IELTS Course structure","Available IELTS coaching mode", "IELTS training options"],
                "Answer": "We offer various IELTS coaching options, including Private Classes, Unlimited Group Classes, and One-on-One Sessions, tailored to fit your needs."
            },
  
            {
                
                "Keywords": ["IELTS preparation", "overview of ielts course","strycture of ielts course"],
                "Answer": "Our IELTS preparation course includes practice exams, expert feedback, and targeted training on all four sections: Listening, Reading, Writing, and Speaking."
            },
            
            {
               
                "Keywords": ["IELTS class locations", "Where is IELTS coaching held?", "IELTS locations"],
                "Answer": "IELTS classes are available in Parramatta Sydney. We also offer online coaching options."
            }, 
              {
                  
                  "Answer": "The IELTS listening test lasts approximately 30 minutes, containing 40 questions. It is divided into four parts: parts one and two cover everyday interactions and social situations, while parts three and four focus on educational and training situations. Various accents, including British, American, Australian, and New Zealand, are used in the recordings.",
                  "Keywords": ["IELTS", "Listening test","structure", "Duration", "Questions"]
              },
              {
                  
                  "Answer": "The IELTS reading test consists of 40 questions across three sections and lasts for 60 minutes. Texts come from various sources, including newspapers, books, magazines, journals, and websites. The topics covered are of general interest and may be written in different styles. Some texts may contain diagrams, graphs, or illustrations, and at least one text will include a detailed and logical argument.",
                  "Keywords": ["IELTS", "Reading test ","structure " ,"Sections", "Duration", "Sources", "Argument"]
              },
              {
                  "Answer": "The IELTS writing test lasts for 60 minutes and includes two tasks. Task one requires describing visual information (a graph, table, chart, or diagram) in 150 words within 20 minutes. Task two involves writing 250 words on a given argument or point of view in 40 minutes. Full sentences must be used, with no bullet points or notes.",
                  "Keywords": ["IELTS", "Writing test", "Tasks", "Duration", "Visual Information", "Argument"]
              },
              {

                  "Answer": "The IELTS speaking test is a face-to-face interview between the candidate and an examiner, lasting between 11 to 14 minutes. It is divided into three parts and assessed based on fluency and coherence, lexical resource, grammatical range and accuracy, and pronunciation.",
                  "Keywords": ["IELTS", "Speaking test ", "Interview", "Duration", "Assessment", "Fluency"]
              },
              {
                 
                  "Answer": "The IELTS reading test features texts from newspapers, books, magazines, journals, and websites. The topics are of general interest and can include diagrams, graphs, or illustrations. At least one text will present a detailed and logical argument.",
                  "Keywords": ["IELTS", "Reading test", "Texts", "Sources", "Diagrams", "Argument"]
              },
              {
                 
                  "Keywords": [ "duration of Listening test ", "time","Duration"],
                  "Answer": "The IELTS listening test lasts approximately 30 minutes."
              },
              {
                  
                  "Keywords": ["IELTS", "Listening", "Questions","Number"],
                  "Answer": "The IELTS listening test contains 40 questions."
              },
             
                 { 
                  "Keywords": ["Reading", "Duration","time"],
                  "Answer": "The IELTS reading test lasts 60 minutes."
              },
              {
                 
                  "Keywords": ["Reading", "Questions","test","number"],
                  "Answer": "The IELTS reading test contains 40 questions."
              },
              {
                 
                  "Keywords": ["Reading", "test","Structure"],
                  "Answer": "The reading test consists of three sections with texts from various sources such as newspapers, books, magazines, and websites."
              },
              {
                  
                  "Keywords": ["Writing", "test", "Duration"],
                  "Answer": "The IELTS writing test lasts for 60 minutes."
              },
              {
                  
                  "Keywords": [ "Writing", "test","Structure"],
                  "Answer": "The writing test consists of two tasks: describing visual information in 150 words for task one, and discussing an argument in 250 words for task two."
              },
              {
                  
                  "Keywords": ["Speaking", "Duration","time","test"],
                  "Answer": "The IELTS speaking test lasts between 11 to 14 minutes."
              },
              {
                  
                  "Keywords": [ "Speaking", "Structure"],
                  "Answer": "The speaking test is a face-to-face interview divided into three parts, assessed on fluency, coherence, and pronunciation."
              },
              {
                 
                  "Keywords": ["explain","IELTS", "Coaching", "detailse","Course Structure", "Mock Tests", "Practice Materials"],
                  "Answer": "The duration of our IELTS course varies based on the chosen mode. Typically, our courses are designed to be flexible to accommodate different learning paces.The IELTS coaching course typically lasts between 2 to 4 weeks and includes 8 mock tests. It provides over 900 practice materials and features more than 750 repeated questions to help students prepare thoroughly for the exam."
              },
              {
                 
                  "Keywords": ["ielts class locations", "Where is ielts coaching held?", "ielts locations"],
                  "Answer": "ielts classes are offered in paramatta and Sydney."
              }
          
        ],
        "PTE": [
            {
                
                "Keywords": ["What is PTE?", "Explain PTE", "Tell me about PTE"],
                "Answer": "PTE stands for Pearson Test of English Academic and is a language test designed to assess the English language skills of non-native speakers. This test can be used to apply for university courses and various visas in Australia and other English-speaking countries. It’s a computer-based test that returns results within two days."
              },
            
            {
               
                "Keywords": ["Book PTE class", "book a PTE","PTE registration", "Sign up for PTE"],
                "Answer": "You can easily book a PTE class through our website by visiting the PTE section and choosing your preferred mode and timing."
            },
            {
                
                "Keywords": ["PTE class locations", "Where is PTE coaching held?", "PTE locations"],
                "Answer": "PTE classes are offered in paramatta,Sydney and Melbourne, with online options available as well."
            },
           
            
             {
                  
                  "Keywords": ["computer-based", "fast", "accurate", "assessment", "algorithm", "results", "stress-free"],
                  "Answer": "The computer system uses an algorithm to mark your test, therefore you can be assured of fast and accurate assessment. Test results are usually received within 48 hours, which is a big advantage if you need results quickly. This format is less stressful as you don’t have to speak to an examiner or write out answers by hand."
              },
              {
                 
                  "Keywords": ["section in pte exam", "pte test", "PTE exam structure","pte test pattern"],
                  "Answer": "PTE exams are 100% computer-based. There are 20 different types of questions, ranging from multiple-choice to essay and comprehension questions. The test is three hours long and divided into three sections: Part 1 – Speaking and Writing (77-93 minutes) Part 2 – Reading (32-41 minutes), Part 3 – Listening (45-57 minutes)."
              },
              {
                  "Keywords": ["recognised", "colleges", "institutions", "PTE training", "English fluency", "visa", "migration"],
                  "Answer": "Yes! More than 3,000 colleges, institutions, universities, and professional bodies use PTE to assess applicants’ English fluency. The UK, New Zealand, and Australian Governments all accept PTE as proof of English proficiency for visa and migration applications."
              },
              {
                  
                  "Keywords": ["PTE", "online training", "flexible", "coaching", "timetable", "availability"],
                  "Answer": "We specialise in flexible online and in-person PTE coaching with a flexible class timetable to fit in with your availability. Courses range from two weeks to indefinite coaching for those wanting maximum support."
              },
              {
                  
                  "Keywords": ["pass exam", "first try", "support", "practice sessions"],
                  "Answer": " We offer flexible course modalities and unlimited practice sessions to ensure each student passes on their first try. Typically, students need around ten hours of classes and ten hours of practice sessions to successfully complete the PTE."
              },
              {
                 
                  "Keywords": ["PTE", "courses structure", "mode", "Available PTE coaching", "PTE training options", "PTE classes", "Englishfirm", "two-week crash courses", "four-week courses", "unlimited courses"],
                  "Answer": "We offer various PTE coaching options including Online, Private Classes, Unlimited Group Classes, and Crash Courses. Specifically, we provide two-week crash courses for students who need test results quickly, four-week courses covering a wide range of techniques across all four modules, and unlimited courses that run until the student achieves their target result."
              },
              
              {
             
                  "Keywords": ["start PTE course", "online", "personal trainer", "availability"],
                  "Answer": "We operate seven days a week and offer online classes almost any time. You’ll be assigned a personal trainer for the duration of your studies, and you can book in times that suit you."
              },
              {
              
                  "Keywords": ["compare", "PTE", "IELTS", "stress", "results", "convert"],
                  "Answer": "Our students find PTE less stressful and easier to prepare for. Results are also quicker, usually within 48 hours. If you ever need to convert your PTE results to IELTS scores, it’s easily done."
              }
          ],
          
      "NAATI": [
          {
             
              "Keywords": ["NAATI CCL test format", "NAATI exam structure", "Dialogue passages", "Segment length", "Language split"],
              "Answer": "CCL exams are online and consist of two dialogues between a native English speaker and a LOTE (Language Other Than English) speaker. Each dialogue is about 300 words, divided into segments of up to 35 words. The dialogue is 50% in English and 50% in the test language, and the candidate responds after each segment."
          },
          {
             
              "Keywords": ["NAATI CCL test results timeline", "NAATI results wait time", "CCL exam result schedule"],
              "Answer": "CCL test results are usually released within 8-10 weeks after the test is completed."
          },
          {
            
              "Keywords": ["NAATI CCL test marking", "NAATI test score", "Marking scheme", "Pass criteria", "Error penalties"],
              "Answer": "Each dialogue passage is marked out of 45 points, and you need 29 points per passage and 63 out of 90 overall to pass. Errors in grammar, pronunciation, and vocabulary can result in penalties, though corrections are allowed but may lead to point deductions."
          },
          {
              "Keywords": ["NAATI CCL test topics", "NAATI test subject areas", "Common topics in NAATI exam"],
              "Answer": "NAATI CCL test topics include Health, Legal, Community, Immigration, Education, Social Services, Finance, Housing, Business, Employment, Insurance, and Consumer Affairs."
          },
          {
            
              "Keywords": ["CCL note-taking tips", "NAATI exam strategy", "Note-taking during CCL test"],
              "Answer": "Use abbreviations, develop a personal note-taking strategy, listen and make notes simultaneously, and focus on understanding the dialogue. Accurately record names, dates, locations, and addresses."
          },
          {
              
              "Keywords": ["Best CCL course Sydney", "NAATI CCL preparation", "Course focus areas"],
              "Answer": "The best CCL course integrates theory and practice, focusing on speaking clearly in both languages, maintaining fluency, and expanding vocabulary using resources like the Shabd Kosh Dictionary."
          },
      
          {
              
              "Keywords": ["NAATI certification", "Interpreter certification", "Translation certification"],
              "Answer": "NAATI certification is a standard for interpreters and translators in Australia, ensuring their skills meet the requirements for professional practice."
          },
          {
           
              "Keywords": ["NAATI coaching", "NAATI exam preparation", "NAATI interpretation training"],
              "Answer": "NAATI coaching provides specialized training to help candidates pass the NAATI certification exam, focusing on both interpretation and translation skills."
          },
          {
              "Keywords": ["NAATI Sydney location", "NAATI coaching in Sydney", "NAATI Sydney classes"],
              "Answer": "You can attend NAATI classes in Sydneylocation. We also offer online coaching for your convenience."
            }
      ],
      "General English Course": [
      {
        
        "Keywords": ["General English course", "English course Sydney", "Improve English skills"],
        "Answer": "The General English course at Englishfirm is designed to help non-native speakers rapidly improve their English speaking, listening, reading, and writing skills. With a team of passionate educators, the course provides both in-person and online coaching to improve grammar, expand vocabulary, and refine fluency."
      },
      {
       
        "Keywords": ["English course delivery", "Sydney English course", "online and in-person coaching"],
        "Answer": "Englishfirm offers in-person and online coaching options for their General English course. These lessons are available at convenient times, fitting the student’s schedule, with a choice of one-on-one or group sessions."
      },
      {
        
        "Keywords": ["Improve English skills", "English proficiency", "English course Sydney"],
        "Answer": "Students taking the General English course at Englishfirm will work on improving key language skills, including speaking, listening, reading, and writing. The focus will be on refining fluency, enhancing grammar, expanding vocabulary, and developing everyday language proficiency."
      },
      {
       
        "Keywords": ["English course benefits", "Sydney English coaching", "English skills development"],
        "Answer": "By the end of the General English course at Englishfirm, students will feel more confident in their English language skills, with the ability to express their thoughts, opinions, and desires clearly in various settings. The course helps students build everyday language skills through practical lessons tailored to individual goals."
      },
      {
        
        "Keywords": ["General English course structure", "Sydney English training", "English course lessons"],
        "Answer": "Englishfirm’s General English course is structured around practical lessons designed to improve everyday language skills. The course offers customizable programs, allowing students to focus on specific areas they want to improve. Lessons are available in both one-on-one private coaching sessions and group classes."
      },
      {
        
        "Keywords": ["Private English classes", "Group English classes", "English coaching Sydney"],
        "Answer": "Englishfirm offers private one-on-one lessons, which are the fastest and easiest way to improve English skills, as well as group classes, which are spread over four or eight weeks and suitable for beginners or those needing a refresher. Private classes can be taken online or in person, while group classes accommodate larger numbers."
      },
      {
        "Keywords": ["Flexible English classes", "Unlimited English coaching", "Sydney English lessons"],
        "Answer": "Englishfirm offers flexible options like Unlimited Classes, where students can access coaching for as long as needed, both in-person and online. These classes allow students to continue improving their English over time, with consistent effort."
      },
      {
     
        "Keywords": ["Crash courses", "English crash classes", "Sydney English course"],
        "Answer": "Crash courses are available for students who need to improve their English quickly, such as for an upcoming event or obligation. These specially designed classes are available both online and in-person and focus on the specific needs of the student."
      },
      {
        
        "Keywords": ["Choose Englishfirm", "English school Sydney", "English classes Sydney"],
        "Answer": "Englishfirm is renowned for its highly qualified trainers and state-of-the-art centres. Students from all walks of life are welcomed, and the course has been proven to help improve English fluency, whether the goal is for everyday communication, a new job, or higher education."
      },
      {
        
        "Keywords": ["Book English classes", "English course booking", "Sydney English lessons"],
        "Answer": "You can book General English classes at Englishfirm by visiting their website and scheduling a complimentary, obligation-free demonstration session. This allows prospective students to experience the teaching methods before committing to the course."
      }
    ]
  },
    "Locations": {
        "Parramatta": [
            {
               
                "Keywords": ["Parramatta address", "Where is Parramatta center?", "Parramatta location"],
                "Answer": "Our Parramatta center is located at Level 6 Suite 612/118 Church St, Parramatta NSW 2150."
            },
            {
              
                "Keywords": ["Contact Parramatta", "Parramatta phone number", "Parramatta office contact"],
                "Answer": "You can reach our Parramatta office at +61432269874."
            },
            {
               
                "Keywords": ["Courses in Parramatta", "What is offered in Parramatta?", "Parramatta coaching options"],
                "Answer": "Our Parramatta center offers courses in IELTS, PTE, and General English."
            }
        ],
        "Sydney": [
            {
                "Keywords": ["Sydney address", "Where is Sydney center?", "Sydney location"],
                "Answer": "Our Sydney office is conveniently located, but please contact us directly for the exact address."
            },
            {
                
                "Keywords": ["Contact Sydney", "Sydney phone number", "Sydney office contact"],
                "Answer": "You can reach our Sydney office at +61432269874."
            },
            {
                
                "Keywords": ["Courses in Sydney", "What is offered in Sydney?", "Sydney coaching options"],
                "Answer": "In Sydney, we offer a variety of courses, including IELTS, PTE, and NAATI training."
            }
        ],
        "Melbourne": [
            {
            
                "Keywords": ["Melbourne address", "Where is Melbourne center?", "Melbourne location"],
                "Answer": "Our Melbourne center is located at Level 21, 459 Collins Street, Melbourne."
            },
            {
                
                "Keywords": ["Contact Melbourne", "Melbourne phone number", "Melbourne office contact"],
                "Answer": "You can reach our Melbourne office at +61432269874."
            },
            {
              
                "Keywords": ["Courses in Melbourne", "What is offered in Melbourne?", "Melbourne coaching options"],
                "Answer": "Our Melbourne center specializes in PTE and IELTS coaching."
            }
        ],
        
          "Kochi": [
            {
              
              "Keywords": ["Kochi address", "Where is Kochi center?", "Kochi location"],
              "Answer": "Our Kochi center is located at S Janatha Rd, Palarivattom, Kochi, Kerala."
            },
            {
              
              "Keywords": ["Contact Kochi", "Kochi phone number", "Kochi office contact"],
              "Answer": "You can reach our Kochi office at +917356326173."
            }
          ]
        
        
    },
    "Coaching_Modes": {
        "Online": [
            {
               
                "Keywords": ["Online coaching", "Online classes", "Virtual learning options"],
                "Answer": "We offer flexible online coaching for IELTS, PTE, and General English, allowing you to learn from the comfort of your home."
            },
            {
              
                "Keywords": ["Online class format", "How do online classes work?", "Online class process"],
                "Answer": "Our online classes are conducted through live sessions, where you can interact with trainers in real-time and access recorded sessions for review."
            }
        ],
        "Private Classes": [
            {
                
                "Keywords": ["Private classes", "One-on-one coaching", "Personalized training"],
                "Answer": "Private classes offer one-on-one coaching tailored to your specific needs, providing focused attention and customized learning plans."
            },
            {
                
                "Keywords": ["Book private class", "Sign up for one-on-one", "Private coaching registration"],
                "Answer": "You can book a private class by visiting our website and choosing your preferred course and timing."
            }
        ],
        "Group Classes": [
            {
                
                "Keywords": ["Group classes", "Classroom learning", "Group coaching"],
                "Answer": "Group classes involve learning with other students, offering a collaborative environment where you can practice and learn together."
            },
            {
               
                "Keywords": ["Group size", "Class size", "How many in group class?"],
                "Answer": "Our group classes are designed to be small, ensuring that each student receives adequate attention and support."
            }
        ]
    },
     "contact":{
      "PTE":[
          {
        "Keywords": ["PTE Demo","enroll","Sign up","admission", "services do you offer","to join PTE","for joining PTE", "for PTE Booking", "link","Book PTE Demo"],
   
        "Answer": "You can book your free PTE demo session by visiting our booking page here: https://englishfirm.com/book-online/. Our PTE course provides personalized coaching with expert tips and strategies to boost your performance."
      }
       ],
      "IELTS": [
          {
        "Keywords": ["IELTS Demo", "enroll","Sign up","admission","IELTS Booking", "Book IELTS Demo","to join IELTS","for joining IELTS"],
       
        "Answer": "To book a free IELTS demo session, please visit our booking page here:https://englishfirm.com/ielts-booking/ . Our comprehensive training focuses on all four IELTS sections with practice exams to ensure you achieve the best results."
      }],   
      "NAATI": [{
        "Keywords": ["NAATI Demo", "enroll","Sign up","admission","NAATI Booking", "Book NAATI Demo","to join NAATI","for joining NAATI"],
        
        "Answer": "You can book a free demo for the NAATI course by going to our booking page here: https://englishfirm.com/naati-booking/. Our NAATI course is designed to develop interpretation and translation skills for certification."
      }],
      "University Admission Consultation":[{
        "Keywords": ["University Admission Consultation Demo","admission", "enroll","Sign up","University Consultation Booking", "Book University Consultation"],
        
        "Answer": "To book your free university admission consultation session, please use this link: https://englishfirm.com/university-admission-consultation/ ,We provide expert guidance on the application process, course selection, and visa requirements."
      }],
      "Trainers": [
      {
        
        "Keywords": ["PTE", "Coaching handles","trainer"],
        "Answer": "Avanti handles PTE coaching. You can book a free demo with Avanti kindly click on https://englishfirm.com/pte-booking/."
      },
      {
        
        "Keywords": ["IELTS", "Coaching handles","trainer"],
        "Answer": "Nimisha James handles IELTS coaching. You can book a free demo with Nimisha kindly click on https://englishfirm.com/ielts-booking/."
      },
      {
       
        "Keywords": ["NAATI", "Coaching handles","trainer"],
        "Answer": "Avanti handles NAATI training. You can book a free demo with Avanti kindly click on https://englishfirm.com/naati-booking/."
      },
      {
        
        "Keywords": ["General English", "General English  joining","Coaching handles","trainer"],
        "Answer": "Nimisha James handles General English classes. You can book a free demo with Nimisha kindly click on https://englishfirm.com/generalenglish-booking/."
      },
      {
        
        "Keywords": ["University Admissions","contact for joining","available","handles","trainer"],
        "Answer": "Kaspin handles University Admissions counseling. You can book a free demo with Kaspin kindly click on https://englishfirm.com/university-admissions-booking."
      },
      {
        
        "Keywords": ["thank you", "thanks", "thank you for your assistance", "thanking for your assistance"],
        "Answer": "You're welcome! I'm happy to help. Let me know if you have any more questions."
      }
    ]
    }
    
    
    
   }
  
  
  
  
    